Parallelisum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-10 Tue 11:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Parallelisum</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Parallelisum</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf615618">Python</a>
<ul>
<li><a href="#org16a944a">Multi Thread</a>
<ul>
<li><a href="#org845224a">pure thread start</a></li>
<li><a href="#org13c5dd1">thread class</a></li>
<li><a href="#orgdb0e79e">thread with Lock</a></li>
</ul>
</li>
<li><a href="#orgcb35fb4">Multi processing</a>
<ul>
<li><a href="#org3de0e4b">pure multi process start</a></li>
<li><a href="#org86daf7c">multi process differ from multi threading</a></li>
<li><a href="#orgb6744cf">Pool</a></li>
<li><a href="#orgc413189">map</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf615618" class="outline-2">
<h2 id="orgf615618">Python</h2>
<div class="outline-text-2" id="text-orgf615618">
</div>
<div id="outline-container-org16a944a" class="outline-3">
<h3 id="org16a944a">Multi Thread</h3>
<div class="outline-text-3" id="text-org16a944a">
</div>
<div id="outline-container-org845224a" class="outline-4">
<h4 id="org845224a">pure thread start</h4>
<div class="outline-text-4" id="text-org845224a">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> threading

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">myfunction</span>(a,b):
    <span style="font-weight: bold;">print</span>(a*b)
<span style="font-weight: bold; font-style: italic;">thread1</span> = threading.Thread(target= myfunction, args=(2,3))
<span style="font-weight: bold; font-style: italic;">thread2</span> = threading.Thread(target= myfunction, args=(3,4))
thread1.start()
thread2.start()

</pre>
</div>

<pre class="example">
6
12

</pre>
</div>
</div>

<div id="outline-container-org13c5dd1" class="outline-4">
<h4 id="org13c5dd1">thread class</h4>
<div class="outline-text-4" id="text-org13c5dd1">
<p>
rewrite <span class="underline"><span class="underline">init</span></span>  and run in class, which inherit class threading.Thread, and start it with start()
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> threading
<span style="font-weight: bold;">import</span> time

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">myThread</span>(threading.Thread):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, threadID, name, counter):
        threading.Thread.__init__(<span style="font-weight: bold;">self</span>)
        <span style="font-weight: bold;">self</span>.threadID = threadID
        <span style="font-weight: bold;">self</span>.name = name
        <span style="font-weight: bold;">self</span>.counter = counter
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">run</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Starting "</span> + <span style="font-weight: bold;">self</span>.name)
        <span style="font-weight: bold;">self</span>.print_time(<span style="font-weight: bold;">self</span>.name, 5, <span style="font-weight: bold;">self</span>.counter)
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Exiting"</span> + <span style="font-weight: bold;">self</span>.name)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">print_time</span>(<span style="font-weight: bold;">self</span>, threadName, counter, delay):
        <span style="font-weight: bold;">while</span> counter:
            time.sleep(delay)
            <span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"{threadName}, {time.ctime(time.time())}"</span>)
            <span style="font-weight: bold; font-style: italic;">counter</span> -= 1
<span style="font-weight: bold; font-style: italic;">thread1</span> = myThread(1, <span style="font-style: italic;">"threadone"</span>, 1)
<span style="font-weight: bold; font-style: italic;">thread2</span> = myThread(2, <span style="font-style: italic;">"threadtwo"</span>, 2)
thread1.start()
thread2.start()
time.sleep(1)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Exiting Main Thread."</span>)

</pre>
</div>

<pre class="example">
Starting threadone
Starting threadtwo
threadone, Tue May 10 12:45:22 2022
Exiting Main Thread.
threadtwo, Tue May 10 12:45:23 2022
threadone, Tue May 10 12:45:23 2022
threadone, Tue May 10 12:45:24 2022
threadtwo, Tue May 10 12:45:25 2022
threadone, Tue May 10 12:45:25 2022
threadone, Tue May 10 12:45:26 2022
Exitingthreadone
threadtwo, Tue May 10 12:45:27 2022
threadtwo, Tue May 10 12:45:29 2022
threadtwo, Tue May 10 12:45:31 2022
Exitingthreadtwo
</pre>
</div>
</div>

<div id="outline-container-orgdb0e79e" class="outline-4">
<h4 id="orgdb0e79e">thread with Lock</h4>
<div class="outline-text-4" id="text-orgdb0e79e">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> threading
<span style="font-weight: bold;">import</span> time

<span style="font-weight: bold; font-style: italic;">myLock</span> = threading.Lock()
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">myThread</span>(threading.Thread):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, threadID, name, counter):
        threading.Thread.__init__(<span style="font-weight: bold;">self</span>)
        <span style="font-weight: bold;">self</span>.threadID = threadID
        <span style="font-weight: bold;">self</span>.name = name
        <span style="font-weight: bold;">self</span>.counter = counter
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">run</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Starting "</span> + <span style="font-weight: bold;">self</span>.name)
        myLock.acquire()
        <span style="font-weight: bold;">self</span>.print_time(<span style="font-weight: bold;">self</span>.name, 5, <span style="font-weight: bold;">self</span>.counter)
        myLock.release()
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Exiting"</span> + <span style="font-weight: bold;">self</span>.name)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">print_time</span>(<span style="font-weight: bold;">self</span>, threadName, counter, delay):
        <span style="font-weight: bold;">while</span> counter:
            time.sleep(delay)
            <span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"{threadName}, {time.ctime(time.time())}"</span>)
            <span style="font-weight: bold; font-style: italic;">counter</span> -= 1

<span style="font-weight: bold; font-style: italic;">thread1</span> = myThread(1, <span style="font-style: italic;">"threadone"</span>, 1)
<span style="font-weight: bold; font-style: italic;">thread2</span> = myThread(2, <span style="font-style: italic;">"threadtwo"</span>, 2)
thread1.start()
thread2.start()
time.sleep(1)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Exiting Main Thread."</span>)

</pre>
</div>

<pre class="example">
Starting threadone
Starting threadtwo
threadone, Tue May 10 12:54:21 2022
Exiting Main Thread.
threadone, Tue May 10 12:54:22 2022
threadone, Tue May 10 12:54:23 2022
threadone, Tue May 10 12:54:24 2022
threadone, Tue May 10 12:54:25 2022
Exitingthreadone
threadtwo, Tue May 10 12:54:27 2022
threadtwo, Tue May 10 12:54:29 2022
threadtwo, Tue May 10 12:54:31 2022
threadtwo, Tue May 10 12:54:33 2022
threadtwo, Tue May 10 12:54:35 2022
Exitingthreadtwo
</pre>
</div>
</div>
</div>


<div id="outline-container-orgcb35fb4" class="outline-3">
<h3 id="orgcb35fb4">Multi processing</h3>
<div class="outline-text-3" id="text-orgcb35fb4">
</div>
<div id="outline-container-org3de0e4b" class="outline-4">
<h4 id="org3de0e4b">pure multi process start</h4>
<div class="outline-text-4" id="text-org3de0e4b">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> multiprocessing
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">myfunction</span>(a,b):
    <span style="font-weight: bold;">print</span>(a*b)
<span style="font-weight: bold; font-style: italic;">process1</span> = multiprocessing.Process(target=myfunction, args=(2,3))
<span style="font-weight: bold; font-style: italic;">process2</span> = multiprocessing.Process(target=myfunction, args=(3,4))
process1.start()
process2.start()
</pre>
</div>

<pre class="example">
6
12

</pre>
</div>
</div>

<div id="outline-container-org86daf7c" class="outline-4">
<h4 id="org86daf7c">multi process differ from multi threading</h4>
<div class="outline-text-4" id="text-org86daf7c">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> multiprocessing
<span style="font-weight: bold;">import</span> threading
<span style="font-weight: bold;">import</span> random

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">myfunction</span> ():
    result.append(random.randint(1,10))
<span style="font-weight: bold; font-style: italic;">####</span><span style="font-weight: bold; font-style: italic;">processing</span>
<span style="font-weight: bold; font-style: italic;">result</span> = []
<span style="font-weight: bold; font-style: italic;">process1</span> = multiprocessing.Process(target=myfunction)
<span style="font-weight: bold; font-style: italic;">process2</span> = multiprocessing.Process(target=myfunction)
process1.start()
process2.start()
process1.join()
process2.join()
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"result of multiprocessing"</span>, result)
<span style="font-weight: bold; font-style: italic;">####</span><span style="font-weight: bold; font-style: italic;">threading</span>
<span style="font-weight: bold; font-style: italic;">result</span> = []
<span style="font-weight: bold; font-style: italic;">thread1</span> = threading.Thread(target=myfunction)
<span style="font-weight: bold; font-style: italic;">thread2</span> = threading.Thread(target=myfunction)
thread1.start()
thread2.start()
thread1.join()
thread2.join()
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"result of multi threading"</span>, result)
</pre>
</div>

<pre class="example">
result of multiprocessing []
result of multi threading [5, 4]

</pre>
</div>
</div>

<div id="outline-container-orgb6744cf" class="outline-4">
<h4 id="orgb6744cf">Pool</h4>
<div class="outline-text-4" id="text-orgb6744cf">
</div>
<ul class="org-ul">
<li><a id="org8a9a1c3"></a>apply<br />
<div class="outline-text-5" id="text-org8a9a1c3">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> multiprocessing <span style="font-weight: bold;">as</span> mp
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">myfunction</span>(a, b):
    <span style="font-weight: bold;">return</span> a*b

<span style="font-weight: bold; font-style: italic;">pool</span> = mp.Pool(mp.cpu_count())
<span style="font-weight: bold; font-style: italic;">result</span> = [ pool.<span style="font-weight: bold;">apply</span>(myfunction, args=(a, 2)) <span style="font-weight: bold;">for</span> a <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, 100) ]
pool.close()
<span style="font-weight: bold;">print</span>(result)

</pre>
</div>

<pre class="example">
[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]

</pre>
</div>
</li>

<li><a id="org8b54f4f"></a>map<br />
<div class="outline-text-5" id="text-org8b54f4f">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> multiprocessing <span style="font-weight: bold;">as</span> mp
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">myfunction</span>(a):
    <span style="font-weight: bold;">return</span> a*a

<span style="font-weight: bold; font-style: italic;">pool</span> = mp.Pool(mp.cpu_count())
<span style="font-weight: bold; font-style: italic;">result</span> =  pool.<span style="font-weight: bold;">map</span>(myfunction, [a <span style="font-weight: bold;">for</span> a <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, 100)]) 
pool.close()
<span style="font-weight: bold;">print</span>(result)

</pre>
</div>

<pre class="example">
[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400, 441, 484, 529, 576, 625, 676, 729, 784, 841, 900, 961, 1024, 1089, 1156, 1225, 1296, 1369, 1444, 1521, 1600, 1681, 1764, 1849, 1936, 2025, 2116, 2209, 2304, 2401, 2500, 2601, 2704, 2809, 2916, 3025, 3136, 3249, 3364, 3481, 3600, 3721, 3844, 3969, 4096, 4225, 4356, 4489, 4624, 4761, 4900, 5041, 5184, 5329, 5476, 5625, 5776, 5929, 6084, 6241, 6400, 6561, 6724, 6889, 7056, 7225, 7396, 7569, 7744, 7921, 8100, 8281, 8464, 8649, 8836, 9025, 9216, 9409, 9604, 9801]

</pre>
</div>
</li>

<li><a id="org2ce4fe5"></a>starmap<br />
<div class="outline-text-5" id="text-org2ce4fe5">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> multiprocessing <span style="font-weight: bold;">as</span> mp
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">myfunction</span>(a, b):
    <span style="font-weight: bold;">return</span> a*b

<span style="font-weight: bold; font-style: italic;">pool</span> = mp.Pool(mp.cpu_count())
<span style="font-weight: bold; font-style: italic;">result</span> = pool.starmap(myfunction, [(a, 2) <span style="font-weight: bold;">for</span> a <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, 100)] ) 
pool.close()
<span style="font-weight: bold;">print</span>(result)

</pre>
</div>

<pre class="example">
[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]

</pre>
</div>
</li>

<li><a id="org381c7f7"></a>apply<sub>async</sub><br />
<div class="outline-text-5" id="text-org381c7f7">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> multiprocessing <span style="font-weight: bold;">as</span> mp
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">myfunction</span>(a, b):
    <span style="font-weight: bold;">return</span> a*b

<span style="font-weight: bold; font-style: italic;">pool</span> = mp.Pool(mp.cpu_count())
<span style="font-weight: bold; font-style: italic;">result</span> = [ pool.apply_async(myfunction, args=(a, 2)) <span style="font-weight: bold;">for</span> a <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, 100)]
<span style="font-weight: bold; font-style: italic;">result</span> = [r.get() <span style="font-weight: bold;">for</span> r <span style="font-weight: bold;">in</span> result]
pool.close()
<span style="font-weight: bold;">print</span>(result)

</pre>
</div>

<pre class="example">
[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]

</pre>
</div>
</li>

<li><a id="orgca34837"></a>apply<sub>async</sub> with callback, must use wait<br />
<div class="outline-text-5" id="text-orgca34837">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> multiprocessing <span style="font-weight: bold;">as</span> mp
<span style="font-weight: bold; font-style: italic;">results</span> = []
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">myfunction</span>(a, b):
    <span style="font-weight: bold;">return</span> a*b
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">collect_result</span>(result):
    <span style="font-weight: bold;">global</span> results
    results.append(result)

<span style="font-weight: bold; font-style: italic;">pool</span> = mp.Pool(mp.cpu_count())
<span style="font-weight: bold;">for</span> a <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, 100):
    <span style="font-weight: bold; font-style: italic;">r</span> = pool.apply_async(myfunction, args=(a, 2), callback=collect_result)
    r.wait()
pool.close()

<span style="font-weight: bold;">print</span>(results)
</pre>
</div>

<pre class="example">
[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]

</pre>
</div>
</li>
</ul>
</div>



<div id="outline-container-orgc413189" class="outline-4">
<h4 id="orgc413189">map</h4>
<div class="outline-text-4" id="text-orgc413189">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> time
<span style="font-weight: bold;">import</span> concurrent.futures

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">do_something</span>(n):
    <span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sleeping {n} seconds"</span>)
    time.sleep(n)
    <span style="font-weight: bold;">return</span> f<span style="font-style: italic;">"Done {n} seconds sleep"</span>


<span style="font-weight: bold;">with</span> concurrent.futures.ProcessPoolExecutor() <span style="font-weight: bold;">as</span> executor:
    <span style="font-weight: bold; font-style: italic;">secs</span> = [5,4,3,2,1]
    <span style="font-weight: bold; font-style: italic;">results</span> = executor.<span style="font-weight: bold;">map</span>(do_something, secs)

    <span style="font-weight: bold;">for</span> result <span style="font-weight: bold;">in</span> results:
        <span style="font-weight: bold;">print</span>(result)

</pre>
</div>

<pre class="example">
sleeping 1 seconds
sleeping 2 seconds
sleeping 3 seconds
sleeping 4 seconds
sleeping 5 seconds
Done 5 seconds sleep
Done 4 seconds sleep
Done 3 seconds sleep
Done 2 seconds sleep
Done 1 seconds sleep
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-05-10 Tue 11:38</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
